{
    "parsed_data": {
        "full name": "Binrui Yang",
        "email id": "by2361@columbia.edu",
        "years of experience": "2 years",
        "employment details": [
            {
                "company": "Travelers",
                "location": "Hartford, CT",
                "position": "Data Science Intern",
                "duration": "June 2024 - Aug 2024",
                "responsibilities": [
                    "Developed an XGBoost classifier to predict IntelliDrive policy-level sufficiency using UPP quote data from over 5 million drivers.",
                    "Crafted an interactive dashboard using Matplotlib and Plotly to visualize the driver’s program completion.",
                    "Automated an end-to-end model pipeline with Apache Airflow and deployed the XGBoost classifier using customized Amazon EC2 and S3 instances.",
                    "Coordinated with cross-functional teams and presented project progress and findings to R&D and business partners."
                ]
            },
            {
                "company": "Eth Tech",
                "location": "Newark, CA",
                "position": "Data Analyst Intern",
                "duration": "June 2022 - Aug 2022",
                "responsibilities": [
                    "Utilized SQL and Tableau for comprehensive data analysis to provide insights into marketing funnels and business KPIs for an online marketplace.",
                    "Employed Logistic Regression and Random Forest models on a dataset of 10M+ users to forecast conversion rates.",
                    "Designed and executed A/B experiments on user conversion funnel flow and leveraged SQL for detailed user journey analysis.",
                    "Collaborated with marketing team to segment users into treatment groups and devised personalized marketing campaign strategy."
                ]
            },
            {
                "company": "Epistemic Analytics",
                "location": "Madison, WI",
                "position": "Data Analyst Intern",
                "duration": "March 2022 - May 2023",
                "responsibilities": [
                    "Developed a data simulation algorithm using Python to generate diverse, stakeholder-specific land-use scenarios from log data for a land-use planning simulation game iPlan.",
                    "Applied Singular Value Decomposition (SVD) for feature selection and dimensionality reduction.",
                    "Created interactive data visualizations using Plotly R to represent and interpret land-use scenarios.",
                    "Applied statistical analysis to map stakeholder satisfaction and project new user-generated scenarios."
                ]
            }
        ],
        "technical skills": "Python, SQL, Tableau, Matplotlib, Plotly, Apache Airflow, Amazon EC2, Amazon S3, Numpy, Pandas, Scikit-Learn, TensorFlow, PyTorch, Logistic Regression, Random Forest, A/B Testing, NLP, Neural Networks, Spark, Kafka, Git, GLM, Decision Tree, KNN, GBM, SVM, K-Means Clustering, Seaborn, Shiny R, ggplot2, Power BI"
    },
    "employment_experiences": "Year of experience: 2 years. Data Science Intern, Developed an XGBoost classifier to predict IntelliDrive policy-level sufficiency using UPP quote data from over 5 million drivers.Crafted an interactive dashboard using Matplotlib and Plotly to visualize the driver’s program completion.Automated an end-to-end model pipeline with Apache Airflow and deployed the XGBoost classifier using customized Amazon EC2 and S3 instances.Coordinated with cross-functional teams and presented project progress and findings to R&D and business partners.Data Analyst Intern, Utilized SQL and Tableau for comprehensive data analysis to provide insights into marketing funnels and business KPIs for an online marketplace.Employed Logistic Regression and Random Forest models on a dataset of 10M+ users to forecast conversion rates.Designed and executed A/B experiments on user conversion funnel flow and leveraged SQL for detailed user journey analysis.Collaborated with marketing team to segment users into treatment groups and devised personalized marketing campaign strategy.Data Analyst Intern, Developed a data simulation algorithm using Python to generate diverse, stakeholder-specific land-use scenarios from log data for a land-use planning simulation game iPlan.Applied Singular Value Decomposition (SVD) for feature selection and dimensionality reduction.Created interactive data visualizations using Plotly R to represent and interpret land-use scenarios.Applied statistical analysis to map stakeholder satisfaction and project new user-generated scenarios.Technical skills: Python, SQL, Tableau, Matplotlib, Plotly, Apache Airflow, Amazon EC2, Amazon S3, Numpy, Pandas, Scikit-Learn, TensorFlow, PyTorch, Logistic Regression, Random Forest, A/B Testing, NLP, Neural Networks, Spark, Kafka, Git, GLM, Decision Tree, KNN, GBM, SVM, K-Means Clustering, Seaborn, Shiny R, ggplot2, Power BI",
    "technical_skills": [
        "Python",
        "SQL",
        "Tableau",
        "Matplotlib",
        "Plotly",
        "Apache Airflow",
        "Amazon EC2",
        "Amazon S3",
        "Numpy",
        "Pandas",
        "Scikit-Learn",
        "TensorFlow",
        "PyTorch",
        "Logistic Regression",
        "Random Forest",
        "A/B Testing",
        "NLP",
        "Neural Networks",
        "Spark",
        "Kafka",
        "Git",
        "GLM",
        "Decision Tree",
        "KNN",
        "GBM",
        "SVM",
        "K-Means Clustering",
        "Seaborn",
        "Shiny R",
        "ggplot2",
        "Power BI"
    ]
}